# frozen_string_literal: true

OOW_TEAM = [
  { name: 'Олег', steam_id: '76561198070904318', steam_account_id: 110638590 },
  { name: 'Тарас', steam_id: '76561198040076918', steam_account_id: 79811190 },
  { name: 'Коля', steam_id: '76561198073694987', steam_account_id: 113429259 },
  { name: 'Ярік', steam_id: '76561198035221577', steam_account_id: 74955849 },
  { name: 'Ден', steam_id: '76561198076298358', steam_account_id: 116032630 },
  { name: 'Шеня', steam_id: '76561198059940772', steam_account_id: 99675044 },
  { name: 'Данк', steam_id: '76561198068523271', steam_account_id: 108257543 },
  { name: 'Посік', steam_id: '76561198027124455', steam_account_id: 66858727 },
  { name: 'Влад', steam_id: '76561198914888395', steam_account_id: 954622667 },
  { name: 'Юра', steam_id: '76561198048275645', steam_account_id: 88009917 },
  { name: 'Петро', steam_id: '76561198369308194', steam_account_id: 409042466 },
  { name: 'Аліна', steam_id: '76561198081618425', steam_account_id: 121352697 },
  { name: 'Андрюха', steam_id: '76561198115329223', steam_account_id: 155063495 },
].freeze

STEAM_GAMES = {
  570 => 'Dota2',
  730 => 'CS:GO',
  578080 => 'PUBG'
}

SHOSHES = [
    'мне чуть стекла не разбились',
    'ну отец то ясно цего 2 труп по скайпу будет сидеть',
    'я это сегодня черный член',
    'у меня теперь 4 глаза не могут фокусироваться',
    'Случайно локтем комп вырубил',
    'Mor 6bl u 4To To JIy4IIIe cni3DaHyYb',
    'продался отписка контент не тот'
  ]

LOH_NAMES = %w[лох пітух анскіл ретард сракабанька пітушара лошара дцп рак підар токсік]
LOH_GAMES = ['Якась діч', 'В якійсь хєрні', 'Дрочить', '🐁']

WIN_PHRASES = ['Вітаю шановні', 'Віннер віннер чікен діннер', 'Ізі гейм', 'Ізі брізі']
LOSE_PHRASES = ['Мінус єбала', 'Не витащили', 'Спробуйте ще', 'Спробуйте іншу гру']
