# frozen_string_literal: true

OOW_TEAM = [
  { name: 'Олег', steam_id: '76561198070904318' },
  { name: 'Тарас', steam_id: '76561198040076918' },
  { name: 'Коля', steam_id: '76561198073694987' },
  { name: 'Ярік', steam_id: '76561198035221577' },
  { name: 'Ден', steam_id: '76561198076298358' },
  { name: 'Шеня', steam_id: '76561198059940772' },
  { name: 'Данк', steam_id: '76561198068523271' },
  { name: 'Посік', steam_id: '76561198027124455' },
  { name: 'Влад', steam_id: '76561198914888395' },
  { name: 'Юра', steam_id: '76561198048275645' },
  { name: 'Петро', steam_id: '76561198369308194' },
].freeze

STEAM_GAMES = {
  570 => 'Dota2',
  730 => 'CS:GO'
}

SHOSHES = [
    'мне чуть стекла не разбились',
    'ну отец то ясно цего 2 труп по скайпу будет сидеть',
    'я это сегодня черный член',
    'у меня теперь 4 глаза не могут фокусироваться',
    'Случайно локтем комп вырубил',
    'Mor 6bl u 4To To JIy4IIIe cni3DaHyYb',
    'продался отписка контент не тот'
  ]

LOH_NAMES = %w[лох пітух анскіл ретард сракабанька пітушара лошара дцп рак підар токсік]
LOH_GAMES = ['Якась діч', 'В якійсь хєрні', 'Дрочить', '🐁']
